# numpy

### np.array, dtype, shape, nbytes

In [44]:
import numpy as np

In [116]:
a = np.array([[1, 2, 3], [4, 5, 6]], float)
a

array([[1., 2., 3.],
       [4., 5., 6.]])

In [117]:
a[1][2]

6.0

In [118]:
type(a[1][2])

numpy.float64

In [119]:
a.shape

(2, 3)

In [120]:
a.nbytes

48

In [121]:
a = np.array([[1, 2, 3], [4, 5, 6]], dtype=np.float64)
type(a[1][2])

numpy.float64

In [122]:
a = np.array([[1, 2, 3], [4, 5, 6]], dtype=np.float32)
type(a[1][2])

numpy.float32

In [123]:
a.nbytes

24

In [124]:
a = np.array([[1, 2, 3], [4, 5, 6]], dtype=int)
type(a[1][2])

numpy.int64

In [125]:
a = np.array([[1, 2, 3], [4, 5, 6]], dtype=np.int64)
type(a[1][2])

numpy.int64

In [126]:
a = np.array([[1, 2, 3], [4, 5, 6]], dtype=np.int32)
type(a[1][2])

numpy.int32

### slicing

In [127]:
a = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]], int)
a[:, 1:]

array([[2, 3],
       [5, 6],
       [8, 9]])

In [128]:
a[1]

array([4, 5, 6])

In [129]:
a[1, 1:3]

array([5, 6])

In [130]:
a[:, ::2]

array([[1, 3],
       [4, 6],
       [7, 9]])

In [131]:
a[::2, ::2]

array([[1, 3],
       [7, 9]])

### arange, ones, zeros, empty, ones_like, zeros_like, identity, eye, diag, random.uniform, random.normal

In [132]:
np.arange(9).reshape(3, 3)

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [133]:
np.arange(0, 5, 0.5)

array([0. , 0.5, 1. , 1.5, 2. , 2.5, 3. , 3.5, 4. , 4.5])

In [134]:
np.ones((2, 2))

array([[1., 1.],
       [1., 1.]])

In [135]:
np.zeros((2, 2))

array([[0., 0.],
       [0., 0.]])

In [136]:
np.empty((2, 2)) # no memory initialization

array([[0., 0.],
       [0., 0.]])

In [137]:
a = np.arange(9).reshape(3, 3)
b = np.ones_like(a)
b

array([[1, 1, 1],
       [1, 1, 1],
       [1, 1, 1]])

In [138]:
np.identity(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [139]:
np.eye(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [140]:
np.eye(3, 5)

array([[1., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 0., 1., 0., 0.]])

In [141]:
np.eye(3, 5, k=2)

array([[0., 0., 1., 0., 0.],
       [0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.]])

In [142]:
a = np.arange(9).reshape(3, 3)
a

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [143]:
d = np.diag(a)
d

array([0, 4, 8])

In [144]:
k = np.diag(a, k=1)
k

array([1, 5])

In [145]:
np.random.uniform(0, 1, 4).reshape(2, 2) # 0: lower bound, 1: upper bound

array([[0.47469686, 0.48008712],
       [0.40355167, 0.61423162]])

In [146]:
np.random.normal(0, 1, 4).reshape(2, 2) # 0: mean, 1: std

array([[-0.956661  , -0.09667153],
       [ 1.10760425,  0.91932715]])

### axis, sum, mean, std, concat

In [147]:
a = np.arange(12).reshape(3, 4)
a

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [148]:
a.sum(axis=0)

array([12, 15, 18, 21])

In [149]:
a.sum(axis=1)

array([ 6, 22, 38])

In [150]:
a.mean()

5.5

In [151]:
a.mean(axis=0)

array([4., 5., 6., 7.])

In [152]:
a.std()

3.452052529534663

In [153]:
a.std(axis=0)

array([3.26598632, 3.26598632, 3.26598632, 3.26598632])

In [154]:
a = np.array([[1, 2, 3]])
b = np.array([[4, 5, 6]])

np.concatenate((a, b), axis=0)

array([[1, 2, 3],
       [4, 5, 6]])

In [155]:
np.concatenate((a, b), axis=1)

array([[1, 2, 3, 4, 5, 6]])

### element-wise matrix multiplication, dot, transpose, broadcasting

In [156]:
# mm

a = np.arange(12).reshape(3, 4)
b = np.arange(12).reshape(3, 4)

c = a*b
c

array([[  0,   1,   4,   9],
       [ 16,  25,  36,  49],
       [ 64,  81, 100, 121]])

In [157]:
# dot

a = np.arange(6).reshape(2, 3)
a

array([[0, 1, 2],
       [3, 4, 5]])

In [158]:
b = np.arange(6).reshape(2, 3).T
b

array([[0, 3],
       [1, 4],
       [2, 5]])

In [159]:
c = np.dot(a, b)
c

array([[ 5, 14],
       [14, 50]])

In [160]:
# broadcasting

a = np.arange(6).reshape(2, 3)
scalar = 3

a + scalar

array([[3, 4, 5],
       [6, 7, 8]])

In [161]:
a = np.arange(12).reshape(4, 3)
a

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11]])

In [162]:
b = np.arange(10, 40, 10)
b

array([10, 20, 30])

In [163]:
c = a + b
c

array([[10, 21, 32],
       [13, 24, 35],
       [16, 27, 38],
       [19, 30, 41]])

### timeit

In [164]:
def scalar_vector_product(scalar, vector):
    result = []
    for v in vector:
        result.append(scalar * v)
    return result

iteration_max = 1000

vector = list(range(iteration_max))
scalar = 2

%timeit scalar_vector_product(scalar, vector) # for loop
%timeit [scalar * v for v in range(iteration_max)] # list comprehension
%timeit scalar * np.arange(iteration_max) # numpy

86.2 µs ± 6.31 µs per loop (mean ± std. dev. of 7 runs, 10,000 loops each)
61.3 µs ± 1.82 µs per loop (mean ± std. dev. of 7 runs, 10,000 loops each)
2.91 µs ± 194 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

### any, all, where, isnan, isfinite, argmax

In [165]:
# any, all

a = np.arange(10)

np.any(a>5)

True

In [166]:
np.all(a<5)

False

In [167]:
a = np.array([1, 3, 0])
b = np.array([5, 2, 1])

a>b

array([False,  True, False])

In [168]:
(a>b).any()

True

In [169]:
# where

a = np.arange(5)
a

array([0, 1, 2, 3, 4])

In [170]:
np.where(a>2) # returns index

(array([3, 4]),)

In [171]:
# isnan, isfinite

a = np.array([1, np.NaN, np.Inf])
a

array([ 1., nan, inf])

In [172]:
np.isnan(a)

array([False,  True, False])

In [173]:
np.isfinite(a)

array([ True, False, False])

In [174]:
# argmax

a = np.random.randint(0, 10, 5)
a

array([7, 3, 3, 7, 1])

In [175]:
np.argmax(a)

0

In [176]:
a = np.random.randint(0, 10, 12).reshape(3, 4)
a

array([[5, 2, 5, 6],
       [6, 1, 5, 3],
       [1, 9, 0, 6]])

In [177]:
np.argmax(a, axis=0) # 'most layered' axis

array([1, 2, 0, 0])

In [178]:
np.argmax(a, axis=1)

array([3, 0, 1])

### boolean index, fancy index

In [179]:
# boolean index

a = np.random.randint(0, 10, 10)
a

array([0, 4, 6, 3, 4, 2, 8, 6, 2, 5])

In [180]:
a>5

array([False, False,  True, False, False, False,  True,  True, False,
       False])

In [181]:
a[a>5]

array([6, 8, 6])

In [182]:
# fancy index

a = np.array([2, 4, 6, 8], float)
b = np.array([0, 0, 1, 3, 2, 1], int) # must be int

a[b]

array([2., 2., 4., 8., 6., 4.])

In [183]:
a = np.array([[1, 4], [9, 16]], float)
a

array([[ 1.,  4.],
       [ 9., 16.]])

In [184]:
b = np.array([0, 0, 1, 1, 0], int)
c = np.array([0, 1, 1, 1, 1], int)

a[b, c]

array([ 1.,  4., 16., 16.,  4.])

### loadtxt, savetxt

In [185]:
a = np.loadtxt('./d/numpy_example.txt')
a

array([[0., 1., 2., 3., 4.],
       [5., 6., 7., 8., 9.]])

In [186]:
a_int = a.astype(int)
a_int

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

In [187]:
np.savetxt('./d/numpy_example.csv', a_int, delimiter=',')

# pandas

In [3]:
import pandas as pd

In [189]:
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'
url = './d/housing.data'

df = pd.read_csv(url, sep='\s+', header=None)
df.shape

(506, 14)

In [190]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [191]:
df.columns = ['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO', 'B', 'LSTAT', 'MEDY']
df.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDY
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [192]:
# Series: 'single column of a dataframe' 
# or 'object representing a column vector'
# or 'one-dimensional ndarray with axis labels'

list_data = [42, 43, 44, 45, 46]
example_obj = pd.Series(list_data)
example_obj

0    42
1    43
2    44
3    45
4    46
dtype: int64

In [193]:
list_data = [1, 2, 3, 4, 5]
list_name = ['a', 'b', 'c', 'd', 'e']
example_obj = pd.Series(data=list_data, index=list_name)
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [194]:
dict_data = {'a':1, 'b':2, 'c':3, 'd':4, 'e':5}
example_obj = pd.Series(dict_data, dtype=np.float32, name='example_data')
example_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [195]:
example_obj['a']

1.0

In [196]:
example_obj.values

array([1., 2., 3., 4., 5.], dtype=float32)

In [197]:
example_obj.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [198]:
example_obj.name = 'number'
example_obj.index.name = 'alphabet'
example_obj

alphabet
a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: number, dtype: float32

In [199]:
dict_data = {'a':1, 'b':2, 'c':3, 'd':4, 'e':5}
indexes = ['a', 'b', 'c', 'd', 'e', 'f', 'g']
example_obj = pd.Series(data=dict_data, index=indexes)
example_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
g    NaN
dtype: float64

In [200]:
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
            'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'], 
            'age': [42, 52, 36, 24, 73], 
            'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}

In [201]:
df = pd.DataFrame(raw_data)
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [202]:
df = pd.DataFrame(raw_data, columns=['age', 'city'])
df

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [203]:
df = pd.DataFrame(raw_data, columns=['first_name', 'last_name', 'age', 'city', 'debt'])
df

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [204]:
df.first_name

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [205]:
df['first_name']

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

### loc, iloc

In [206]:
s = pd.Series(np.nan, index=[49, 48, 47, 46, 45, 1, 2, 3, 4, 5])
s

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
dtype: float64

In [207]:
s.loc[:3] # index name

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [208]:
s.iloc[:3] # index number

49   NaN
48   NaN
47   NaN
dtype: float64

In [209]:
df

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [210]:
df.debt = df.age>40
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

In [211]:
df.T

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
debt                 True       True  False    False    True

In [212]:
df.values

array([['Jason', 'Miller', 42, 'San Francisco', True],
       ['Molly', 'Jacobson', 52, 'Baltimore', True],
       ['Tina', 'Ali', 36, 'Miami', False],
       ['Jake', 'Milner', 24, 'Douglas', False],
       ['Amy', 'Cooze', 73, 'Boston', True]], dtype=object)

In [213]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [214]:
df.to_csv()

',first_name,last_name,age,city,debt\n0,Jason,Miller,42,San Francisco,True\n1,Molly,Jacobson,52,Baltimore,True\n2,Tina,Ali,36,Miami,False\n3,Jake,Milner,24,Douglas,False\n4,Amy,Cooze,73,Boston,True\n'

### del column

In [215]:
del df["debt"]

In [216]:
df[['first_name', 'last_name', 'age']].head(3)

  first_name last_name  age
0      Jason    Miller   42
1      Molly  Jacobson   52
2       Tina       Ali   36

In [217]:
df[['first_name', 'last_name', 'age']].iloc[:3]

  first_name last_name  age
0      Jason    Miller   42
1      Molly  Jacobson   52
2       Tina       Ali   36

In [218]:
age_series = df['age']
age_series

0    42
1    52
2    36
3    24
4    73
Name: age, dtype: int64

In [219]:
age_series[age_series<40]

2    36
3    24
Name: age, dtype: int64

### adding column as index

In [220]:
df.index = df['age']
df

    first_name last_name  age           city
age
42       Jason    Miller   42  San Francisco
52       Molly  Jacobson   52      Baltimore
36        Tina       Ali   36          Miami
24        Jake    Milner   24        Douglas
73         Amy     Cooze   73         Boston

In [221]:
del df['age']

In [222]:
df

    first_name last_name           city
age
42       Jason    Miller  San Francisco
52       Molly  Jacobson      Baltimore
36        Tina       Ali          Miami
24        Jake    Milner        Douglas
73         Amy     Cooze         Boston

### basic, loc, iloc selection

In [223]:
# basic selection

df[['first_name', 'last_name']][:2]

    first_name last_name
age
42       Jason    Miller
52       Molly  Jacobson

In [224]:
# basic + loc selection

df[['first_name', 'last_name']].loc[[42, 52]]

    first_name last_name
age
42       Jason    Miller
52       Molly  Jacobson

In [225]:
# basic + iloc selection

df[['first_name', 'last_name']].iloc[:2]

    first_name last_name
age
42       Jason    Miller
52       Molly  Jacobson

In [226]:
# loc selection

df.loc[[42, 52], ['first_name', 'last_name']]

    first_name last_name
age
42       Jason    Miller
52       Molly  Jacobson

In [227]:
# iloc selection

df.iloc[:2, :2]

    first_name last_name
age
42       Jason    Miller
52       Molly  Jacobson

In [228]:
df

    first_name last_name           city
age
42       Jason    Miller  San Francisco
52       Molly  Jacobson      Baltimore
36        Tina       Ali          Miami
24        Jake    Milner        Douglas
73         Amy     Cooze         Boston

### adding numerical index

In [229]:
df.index = list(range(5))
df

  first_name last_name           city
0      Jason    Miller  San Francisco
1      Molly  Jacobson      Baltimore
2       Tina       Ali          Miami
3       Jake    Milner        Douglas
4        Amy     Cooze         Boston

### drop

In [230]:
df.drop(1)

  first_name last_name           city
0      Jason    Miller  San Francisco
2       Tina       Ali          Miami
3       Jake    Milner        Douglas
4        Amy     Cooze         Boston

In [231]:
df.drop([1, 2, 3])

  first_name last_name           city
0      Jason    Miller  San Francisco
4        Amy     Cooze         Boston

In [232]:
df.drop('city', axis=1)

  first_name last_name
0      Jason    Miller
1      Molly  Jacobson
2       Tina       Ali
3       Jake    Milner
4        Amy     Cooze

In [243]:
y = x ** 2 
y.backward()
x.grad

tensor(4.)

### Series operation

In [245]:
s1 = pd.Series(range(5), index=list('abcde'))
s1

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [246]:
s2 = pd.Series(range(5), index=list('bcdef'))
s2

b    0
c    1
d    2
e    3
f    4
dtype: int64

In [247]:
s1 + s2

a    NaN
b    1.0
c    3.0
d    5.0
e    7.0
f    NaN
dtype: float64

In [248]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3), columns=list('abc'))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [249]:
df2 = pd.DataFrame(np.arange(16).reshape(4,4), columns=list('abcd'))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [250]:
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [251]:
df1.add(df2, fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

### lambda, map, apply

In [253]:
s = pd.Series(np.arange(5))
s

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [256]:
s.map(lambda x: x**2)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [257]:
z = {1: 'A', 2: 'B', 3: 'C'}
s.map(z)

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

In [258]:
z = pd.Series(np.arange(10, 15))
s.map(z)

0    10
1    11
2    12
3    13
4    14
dtype: int64

In [259]:
raw_data = {'earn': [79571.299011, 96396.988643, 48710.666947, 80478.096153, 82089.345498],
           'height': [73.89, 66.23, 63.77, 63.22, 63.08],
           'sex': ['male', 'female', 'female', 'female', 'female'],
           'race': ['white', 'white', 'white', 'other', 'white'],
           'ed': [16, 16, 16, 16, 17],
           'age': [49, 62, 33, 95, 43]}

In [261]:
df = pd.DataFrame(raw_data)
df

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

### df.Series.unique()

In [262]:
df.sex.unique()

array(['male', 'female'], dtype=object)

### transform Series using map() on Series

In [263]:
df['sex_code'] = df.sex.map({'male': 0, 'female': 1})
df

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

### or use replace()

In [264]:
df.sex.replace({'male': 0, 'female': 1})

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [265]:
df.sex.replace(['male', 'female'], [0, 1], inplace=True)
df

           earn  height  sex   race  ed  age  sex_code
0  79571.299011   73.89    0  white  16   49         0
1  96396.988643   66.23    1  white  16   62         1
2  48710.666947   63.77    1  white  16   33         1
3  80478.096153   63.22    1  other  16   95         1
4  82089.345498   63.08    1  white  17   43         1

### or use apply()

In [266]:
df_info = df[['earn', 'height', 'age']]
df_info

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [267]:
f = lambda x: x.max()-x.min()
df_info.apply(f)

earn      47686.321696
height       10.810000
age          62.000000
dtype: float64

In [268]:
df_info.sum()

earn      387246.396252
height       330.190000
age          282.000000
dtype: float64

### apply - return Series

In [271]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
df_info.apply(f)

             earn  height  age
min  48710.666947   63.08   33
max  96396.988643   73.89   95

### applymap()

In [272]:
f = lambda x: -x
df_info.applymap(f)

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [273]:
df_info['earn'].apply(f)

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64

### describe()

In [275]:
del df['sex_code']

In [277]:
df.sex.replace([0, 1], ['male', 'female'], inplace=True)
df

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [278]:
df.describe()

               earn     height         ed        age
count      5.000000   5.000000   5.000000   5.000000
mean   77449.279250  66.038000  16.200000  56.400000
std    17465.182813   4.569614   0.447214  23.995833
min    48710.666947  63.080000  16.000000  33.000000
25%    79571.299011  63.220000  16.000000  43.000000
50%    80478.096153  63.770000  16.000000  49.000000
75%    82089.345498  66.230000  16.000000  62.000000
max    96396.988643  73.890000  17.000000  95.000000

### converting str element into int index

In [279]:
df.race.unique()

array(['white', 'other'], dtype=object)

In [282]:
np.array(dict(enumerate(df['race'].unique())))

array({0: 'white', 1: 'other'}, dtype=object)

In [283]:
value = list(map(int, np.array(list(enumerate(df['race'].unique())))[:, 0].tolist()))
key = np.array(list(enumerate(df['race'].unique())), dtype=str)[:, 1].tolist()

value, key

([0, 1], ['white', 'other'])

In [284]:
df['race'].replace(to_replace=key, value=value, inplace=True)
df

           earn  height     sex  race  ed  age
0  79571.299011   73.89    male     0  16   49
1  96396.988643   66.23  female     0  16   62
2  48710.666947   63.77  female     0  16   33
3  80478.096153   63.22  female     1  16   95
4  82089.345498   63.08  female     0  17   43

### exclude one column

In [290]:
df = df.loc[:, df.columns!='sex']
df

           earn  height  race  ed  age
0  79571.299011   73.89     0  16   49
1  96396.988643   66.23     0  16   62
2  48710.666947   63.77     0  16   33
3  80478.096153   63.22     1  16   95
4  82089.345498   63.08     0  17   43

### exclude multiple columns

In [300]:
df = df.loc[:, ~df.columns.isin(['race', 'ed'])]
df

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [301]:
df.sum(axis=0)

earn      387246.396252
height       330.190000
age          282.000000
dtype: float64

In [302]:
df.sum(axis=1)

0    79694.189011
1    96525.218643
2    48807.436947
3    80636.316153
4    82195.425498
dtype: float64

### isnull()

In [303]:
df.isnull()

    earn  height    age
0  False   False  False
1  False   False  False
2  False   False  False
3  False   False  False
4  False   False  False

### sort_values()

In [304]:
df.sort_values(['earn', 'age'], ascending=True)

           earn  height  age
2  48710.666947   63.77   33
0  79571.299011   73.89   49
3  80478.096153   63.22   95
4  82089.345498   63.08   43
1  96396.988643   66.23   62

In [305]:
df.age.corr(df.earn)

0.4877353663523479

In [306]:
df.age.cov(df.earn)

204405.7997480501

In [307]:
df.corrwith(df.earn)

earn      1.000000
height    0.198031
age       0.487735
dtype: float64

In [308]:
df.corr()

            earn    height       age
earn    1.000000  0.198031  0.487735
height  0.198031  1.000000 -0.166655
age     0.487735 -0.166655  1.000000

### groupby

In [15]:
raw_data = {'Points': [876, 789, 863, 673, 741, 812, 756, 788, 694, 701, 804, 690],
           'Rank': [1, 2, 2, 3, 3, 4, 1, 1, 2, 4, 1, 2],
           'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings', 'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
           'Year': [2014, 2015, 2014, 2015, 2014, 2015, 2016, 2017, 2016, 2014, 2015, 2017]}

In [16]:
df = pd.DataFrame(raw_data)
df

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   Kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017

In [17]:
df.groupby('Team')

In [18]:
df.groupby('Team').sum()

        Points  Rank  Year
Team
Devils    1536     5  4029
Kings     3097     9  8062
Riders    3049     7  8062
Royals    1505     5  4029

In [19]:
df.groupby('Team')['Points'].sum() # Team을 기준으로 Point를 sum
# ('Team'): 묶음의 기준이 되는 col
# ['Points']: 적용받는 col
# .sum(): 적용받는 연산

Team
Devils    1536
Kings     3097
Riders    3049
Royals    1505
Name: Points, dtype: int64

In [20]:
# 한 개 이상의 col을 묶을 수 있음
df.groupby(['Team', 'Year'])['Points'].sum()

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2015    812
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
Name: Points, dtype: int64

### Hierachical index

In [21]:
# multi index

h_index = df.groupby(['Team', 'Year'])['Points'].sum()
h_index.index

MultiIndex([('Devils', 2014),
            ('Devils', 2015),
            ( 'Kings', 2014),
            ( 'Kings', 2015),
            ( 'Kings', 2016),
            ( 'Kings', 2017),
            ('Riders', 2014),
            ('Riders', 2015),
            ('Riders', 2016),
            ('Riders', 2017),
            ('Royals', 2014),
            ('Royals', 2015)],
           names=['Team', 'Year'])

In [22]:
# certain items only

h_index['Devils':'Kings']

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2015    812
        2016    756
        2017    788
Name: Points, dtype: int64

In [23]:
# matrix form

h_index.unstack()

Year     2014   2015   2016   2017
Team
Devils  863.0  673.0    NaN    NaN
Kings   741.0  812.0  756.0  788.0
Riders  876.0  789.0  694.0  690.0
Royals  701.0  804.0    NaN    NaN

In [24]:
# swap Team and Year

h_index.swaplevel()

Year  Team
2014  Devils    863
2015  Devils    673
2014  Kings     741
2015  Kings     812
2016  Kings     756
2017  Kings     788
2014  Riders    876
2015  Riders    789
2016  Riders    694
2017  Riders    690
2014  Royals    701
2015  Royals    804
Name: Points, dtype: int64

In [34]:
h_index.swaplevel().sort_index()

Year  Team
2014  Devils    863
      Kings     741
      Riders    876
      Royals    701
2015  Devils    673
      Kings     812
      Riders    789
      Royals    804
2016  Kings     756
      Riders    694
2017  Kings     788
      Riders    690
Name: Points, dtype: int64

In [36]:
h_index.groupby(level=0).sum()

Team
Devils    1536
Kings     3097
Riders    3049
Royals    1505
Name: Points, dtype: int64

In [37]:
h_index.groupby(level=1).sum()

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [41]:
grouped = df.groupby('Team')

for name, group in grouped:
    print(name)
    print(group)

Devils
   Points  Rank    Team  Year
2     863     2  Devils  2014
3     673     3  Devils  2015
Kings
   Points  Rank   Team  Year
4     741     3  Kings  2014
5     812     4  Kings  2015
6     756     1  Kings  2016
7     788     1  Kings  2017
Riders
    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
8      694     2  Riders  2016
11     690     2  Riders  2017
Royals
    Points  Rank    Team  Year
9      701     4  Royals  2014
10     804     1  Royals  2015

In [42]:
grouped.get_group('Devils')

   Points  Rank    Team  Year
2     863     2  Devils  2014
3     673     3  Devils  2015

### groupby - aggregation

In [45]:
grouped.agg(sum)

        Points  Rank  Year
Team
Devils    1536     5  4029
Kings     3097     9  8062
Riders    3049     7  8062
Royals    1505     5  4029

In [46]:
grouped.agg(np.mean)

        Points  Rank    Year
Team
Devils  768.00  2.50  2014.5
Kings   774.25  2.25  2015.5
Riders  762.25  1.75  2015.5
Royals  752.50  2.50  2014.5

In [47]:
grouped['Points'].agg([np.sum, np.mean, np.std])

         sum    mean         std
Team
Devils  1536  768.00  134.350288
Kings   3097  774.25   31.899582
Riders  3049  762.25   88.567771
Royals  1505  752.50   72.831998

### groupby - transformation

In [48]:
df

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   Kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017

In [49]:
score = lambda x: x.max()
grouped.transform(score)

# grouped by Teams, 
# and values are replaced by the max value of Points, Rank, Year

    Points  Rank  Year
0      876     2  2017
1      876     2  2017
2      863     3  2015
3      863     3  2015
4      812     4  2017
5      812     4  2017
6      812     4  2017
7      812     4  2017
8      876     2  2017
9      804     4  2015
10     804     4  2015
11     876     2  2017

In [50]:
score = lambda x: (x - x.mean()) / x.std()
grouped.transform(score)

      Points      Rank      Year
0   1.284327 -1.500000 -1.161895
1   0.302029  0.500000 -0.387298
2   0.707107 -0.707107 -0.707107
3  -0.707107  0.707107  0.707107
4  -1.042333  0.500000 -1.161895
5   1.183401  1.166667 -0.387298
6  -0.572108 -0.833333  0.387298
7   0.431040 -0.833333  1.161895
8  -0.770596  0.500000  0.387298
9  -0.707107  0.707107 -0.707107
10  0.707107 -0.707107  0.707107
11 -0.815759  0.500000  1.161895

In [52]:
grouped.filter(lambda x: len(x)>=3)
# len(x): grouped된 datagrame의 갯수

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
4      741     3   Kings  2014
5      812     4   Kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
11     690     2  Riders  2017

### Case study

In [67]:
import dateutil

df_phone = pd.read_csv('d/phone_data.csv')
df_phone

     index            date  duration  item    month   network network_type
0        0  15/10/14 06:58    34.429  data  2014-11      data         data
1        1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2        2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3        3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4        4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile
..     ...             ...       ...   ...      ...       ...          ...
825    825  13/03/15 00:38     1.000   sms  2015-03     world        world
826    826  13/03/15 00:39     1.000   sms  2015-03  Vodafone       mobile
827    827  13/03/15 06:58    34.429  data  2015-03      data         data
828    828  14/03/15 00:13     1.000   sms  2015-03     world        world
829    829  14/03/15 00:16     1.000   sms  2015-03     world        world

[830 rows x 7 columns]

In [68]:
df_phone['date'] = df_phone['date'].apply(dateutil.parser.parse, dayfirst=True)
df_phone

     index                date  duration  item    month   network network_type
0        0 2014-10-15 06:58:00    34.429  data  2014-11      data         data
1        1 2014-10-15 06:58:00    13.000  call  2014-11  Vodafone       mobile
2        2 2014-10-15 14:46:00    23.000  call  2014-11    Meteor       mobile
3        3 2014-10-15 14:48:00     4.000  call  2014-11     Tesco       mobile
4        4 2014-10-15 17:27:00     4.000  call  2014-11     Tesco       mobile
..     ...                 ...       ...   ...      ...       ...          ...
825    825 2015-03-13 00:38:00     1.000   sms  2015-03     world        world
826    826 2015-03-13 00:39:00     1.000   sms  2015-03  Vodafone       mobile
827    827 2015-03-13 06:58:00    34.429  data  2015-03      data         data
828    828 2015-03-14 00:13:00     1.000   sms  2015-03     world        world
829    829 2015-03-14 00:16:00     1.000   sms  2015-03     world        world

[830 rows x 7 columns]

In [69]:
df_phone.groupby('month')['duration'].sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [75]:
df_phone.groupby('month', as_index=False).agg({'duration': 'sum'})

     month   duration
0  2014-11  26639.441
1  2014-12  14641.870
2  2015-01  18223.299
3  2015-02  15522.299
4  2015-03  22750.441

In [70]:
df_phone[df_phone['item']=='call']

     index                date  duration  item    month   network network_type
1        1 2014-10-15 06:58:00      13.0  call  2014-11  Vodafone       mobile
2        2 2014-10-15 14:46:00      23.0  call  2014-11    Meteor       mobile
3        3 2014-10-15 14:48:00       4.0  call  2014-11     Tesco       mobile
4        4 2014-10-15 17:27:00       4.0  call  2014-11     Tesco       mobile
5        5 2014-10-15 18:55:00       4.0  call  2014-11     Tesco       mobile
..     ...                 ...       ...   ...      ...       ...          ...
807    807 2015-03-03 10:12:00     745.0  call  2015-03  Vodafone       mobile
808    808 2015-03-03 10:27:00      57.0  call  2015-03  Vodafone       mobile
809    809 2015-03-03 14:34:00    1325.0  call  2015-03  Vodafone       mobile
810    810 2015-03-03 18:36:00     768.0  call  2015-03     Three       mobile
816    816 2015-03-04 12:29:00   10528.0  call  2015-03  landline     landline

[388 rows x 7 columns]

In [71]:
df_phone[df_phone['item']=='call'].groupby('network')['duration'].sum()

network
Meteor        7200.0
Tesco        13828.0
Three        36464.0
Vodafone     14621.0
landline     18433.0
voicemail     1775.0
Name: duration, dtype: float64

In [78]:
df_phone.groupby(['month', 'item'])

In [79]:
df_phone.groupby(['month', 'item'])['date']

In [73]:
df_phone.groupby(['month', 'item'])['date'].count()

month    item
2014-11  call    107
         data     29
         sms      94
2014-12  call     79
         data     30
         sms      48
2015-01  call     88
         data     31
         sms      86
2015-02  call     67
         data     31
         sms      39
2015-03  call     47
         data     29
         sms      25
Name: date, dtype: int64

In [74]:
df_phone.groupby(['month', 'item'])['date'].count().unstack()

item     call  data  sms
month
2014-11   107    29   94
2014-12    79    30   48
2015-01    88    31   86
2015-02    67    31   39
2015-03    47    29   25

In [76]:
df_phone.groupby(['month', 'item']).agg({'duration': [min, max, sum],
                                        'network_type': 'count',
                                        'date': [min, 'first', 'nunique']})

             duration                       network_type                date  \
                  min        max        sum        count                 min
month   item
2014-11 call    1.000   1940.000  25547.000          107 2014-10-15 06:58:00
        data   34.429     34.429    998.441           29 2014-10-15 06:58:00
        sms     1.000      1.000     94.000           94 2014-10-16 22:18:00
2014-12 call    2.000   2120.000  13561.000           79 2014-11-14 17:24:00
        data   34.429     34.429   1032.870           30 2014-11-13 06:58:00
        sms     1.000      1.000     48.000           48 2014-11-14 17:28:00
2015-01 call    2.000   1859.000  17070.000           88 2014-12-15 20:03:00
        data   34.429     34.429   1067.299           31 2014-12-13 06:58:00
        sms     1.000      1.000     86.000           86 2014-12-15 19:56:00
2015-02 call    1.000   1863.000  14416.000           67 2015-01-15 10:36:00
        data   34.429     34.429   1067.299           31 2015-01-13 06:58:00
        sms     1.000      1.000     39.000           39 2015-01-15 12:23:00
2015-03 call    2.000  10528.000  21727.000           47 2015-02-12 20:15:00
        data   34.429     34.429    998.441           29 2015-02-13 06:58:00
        sms     1.000      1.000     25.000           25 2015-02-19 18:46:00


                           first nunique
month   item
2014-11 call 2014-10-15 06:58:00     104
        data 2014-10-15 06:58:00      29
        sms  2014-10-16 22:18:00      79
2014-12 call 2014-11-14 17:24:00      76
        data 2014-11-13 06:58:00      30
        sms  2014-11-14 17:28:00      41
2015-01 call 2014-12-15 20:03:00      84
        data 2014-12-13 06:58:00      31
        sms  2014-12-15 19:56:00      58
2015-02 call 2015-01-15 10:36:00      67
        data 2015-01-13 06:58:00      31
        sms  2015-01-15 12:23:00      27
2015-03 call 2015-02-12 20:15:00      47
        data 2015-02-13 06:58:00      29
        sms  2015-02-19 18:46:00      17

In [80]:
grouped = df_phone.groupby('month').agg({'duration': [min, max, np.mean]})
grouped.columns = grouped.columns.droplevel(level=0)
grouped.rename(columns={'min': 'min_duration', 'max': 'max_duration', 'mean': 'mean_duration'})

         min_duration  max_duration  mean_duration
month
2014-11           1.0        1940.0     115.823657
2014-12           1.0        2120.0      93.260318
2015-01           1.0        1859.0      88.894141
2015-02           1.0        1863.0     113.301453
2015-03           1.0       10528.0     225.251891

### Pivot table

In [82]:
df_phone

     index                date  duration  item    month   network network_type
0        0 2014-10-15 06:58:00    34.429  data  2014-11      data         data
1        1 2014-10-15 06:58:00    13.000  call  2014-11  Vodafone       mobile
2        2 2014-10-15 14:46:00    23.000  call  2014-11    Meteor       mobile
3        3 2014-10-15 14:48:00     4.000  call  2014-11     Tesco       mobile
4        4 2014-10-15 17:27:00     4.000  call  2014-11     Tesco       mobile
..     ...                 ...       ...   ...      ...       ...          ...
825    825 2015-03-13 00:38:00     1.000   sms  2015-03     world        world
826    826 2015-03-13 00:39:00     1.000   sms  2015-03  Vodafone       mobile
827    827 2015-03-13 06:58:00    34.429  data  2015-03      data         data
828    828 2015-03-14 00:13:00     1.000   sms  2015-03     world        world
829    829 2015-03-14 00:16:00     1.000   sms  2015-03     world        world

[830 rows x 7 columns]

In [83]:
df_phone.pivot_table(['duration'],
                    index=[df_phone.month, df_phone.item],
                    columns=df_phone.network, 
                    aggfunc='sum',
                    fill_value=0)

             duration                                                   \
network        Meteor Tesco  Three Vodafone      data landline special
month   item
2014-11 call     1521  4045  12458     4316     0.000     2906       0
        data        0     0      0        0   998.441        0       0
        sms        10     3     25       55     0.000        0       1
2014-12 call     2010  1819   6316     1302     0.000     1424       0
        data        0     0      0        0  1032.870        0       0
        sms        12     1     13       18     0.000        0       0
2015-01 call     2207  2904   6445     3626     0.000     1603       0
        data        0     0      0        0  1067.299        0       0
        sms        10     3     33       40     0.000        0       0
2015-02 call     1188  4087   6279     1864     0.000      730       0
        data        0     0      0        0  1067.299        0       0
        sms         1     2     11       23     0.000        0       2
2015-03 call      274   973   4966     3513     0.000    11770       0
        data        0     0      0        0   998.441        0       0
        sms         0     4      5       13     0.000        0       0


network      voicemail world
month   item
2014-11 call       301     0
        data         0     0
        sms          0     0
2014-12 call       690     0
        data         0     0
        sms          0     4
2015-01 call       285     0
        data         0     0
        sms          0     0
2015-02 call       268     0
        data         0     0
        sms          0     0
2015-03 call       231     0
        data         0     0
        sms          0     3